WcfMovieService/Examples/El Señor de los Anillos.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:wcf="http://schemas.datacontract.org/2004/07/WcfMovieService">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddMovie>
         <tem:movie>
            <wcf:Code>MDE3265981</wcf:Code>
            <wcf:Director>Peter Jackson</wcf:Director>
            <wcf:Id>0</wcf:Id>
            <wcf:Title>The Lord of the Rings: The Fellowship of the Ring</wcf:Title>
            <wcf:Year>2001</wcf:Year>
         </tem:movie>
      </tem:AddMovie>
   </soapenv:Body>
</soapenv:Envelope>